{
  "metadata": {
    "title": "Takeshi's Portfolio",
    "description": "タケシさんのポートフォリオを発見し、彼の開発スキルと開発の旅における情熱をご覧ください。.",
    "og:title": "Takeshi's Portfolio",
    "og:description": "私の最新のプロジェクトをご覧いただき、React、Next.js、TypeScriptを専門とする開発者としての私の歩みについてご紹介します。"
  },
  "header": {
    "aboutMe": "自己紹介",
    "projects": "プロジェクト",
    "contact": "お問い合わせ",
    "switchLanguage": "言語を切り替える",
    "language": "言語",
    "english": "英語",
    "japanese": "日本語"
  },
  "index": {
    "heroTitle": "情熱的な<span>プログラマー</span>",
    "heroIntroduction": "こんにちは、<span>タケシ</span>と申します。。コーディングと素晴らしいものを<br></br>作ることが大好きな情熱的なプログラマーです。",
    "skill": "技術スタック",
    "me7yearsAgo": "7年前の私",
    "tryHovering": "これらにカーソルを合わせてみてください！",
    "curlyArrow": "曲線矢印",
    "phpDescription": "PHPは、特にウェブ開発に適している人気のある汎用スクリプト言語です。",
    "sqlDescription": "SQLは、リレーショナルデータベース管理システムのための標準化されたクエリ言語です。",
    "jsDescription": "JavaScriptは、ECMAScript仕様に準拠した高水準のインタープリタ型プログラミング言語です。",
    "tsDescription": "TypeScriptは、JavaScriptの厳密な構文上位集合で、言語にオプションの静的型付けを追加します。",
    "reactDescription": "Reactは、ユーザーインターフェースを構築するためのJavaScriptライブラリです。",
    "nextDescription": "Next.jsは、Reactベースのウェブアプリケーションにサーバーサイドレンダリングや静的ウェブサイト生成などの機能を可能にするReactフレームワークです。",
    "nodeDescription": "Node.jsは、V8エンジン上で動作し、ウェブブラウザ外でJavaScriptコードを実行するオープンソースのクロスプラットフォームバックエンドJavaScript実行環境です。",
    "expressDescription": "Express.jsは、バックエンドJavaScript実行環境であるNode.js用のウェブアプリケーションフレームワークです。",
    "awsDescription": "Amazon Web Services（AWS）は、個人、企業、政府に従量制のクラウドコンピューティングプラットフォームとAPIを提供するAmazonの子会社です。",
    "redisDescription": "Redisは、データベース、キャッシュ、メッセージブローカーとして使用されるオープンソースのインメモリデータ構造ストアです。",
    "aboutMe": "自己紹介",
    "aboutMeDescription": "はじめまして、フィリピン出身で現在日本に住んでいる<strong>タケシ</strong>と申します。私の<strong>強い</strong>情熱は、日々<strong>スキルを向上させ</strong>、新しい挑戦を受け入れる原動力となっています。<strong>個人の成長</strong>に取り組み、開発分野での知識を常に拡大するよう努めています。",
    "featuredProjects": "プロジェクト",
    "omnipartsDescription": "Omnipartsを作成したのは、フルスタックのeコマース開発の理解を深めるためで、特に決済システムと管理ダッシュボードの作成に焦点を当てました。まずウェブサイトに必要なフロントエンドページを構築し、次にNext.jsとtRPCを使用してバックエンドの開発と統合を進めました。主な苦労は決済システムで、特にウェブフックの処理とStripe SDKを使用して決済プロセスをシミュレートすることでした。",
    "budgetplexDescription": "Budgetplexは、友人が給与を追跡するアプリが必要だったため、そして私が新しく習得したtRPCとshadcn/uiの知識を適用したかったため構築しました。予算追跡、給与追跡、請求書通知、財務目標などの機能が含まれています。開発中、日付と時間の機能に関する課題に直面しましたが、これらの困難にもかかわらず、成功裏に克服し、日付と時間の操作に関する貴重な経験を得ました。",
    "zeetaaDescription": "Zeetaaは学校のプロジェクトで、デザインとCSSを担当したパートナーと協力し、リアルタイムチャット機能の作成方法を学ぶ機会として取り組みました。友達リクエストやチャットテーブルの複雑なデータベース設定のため、プロジェクトは困難でした。また、CSSをmodule.cssに変換して適切に機能させる必要がありました。リアルタイムチャット機能の構築を含むこれらの困難にもかかわらず、プロジェクトを成功裏に完了しました。この経験により、バックエンド開発スキルを磨き、問題をより効果的に解決し、チーム環境で効率的に作業する能力が向上しました。",
    "gamiplexDescription": "Gamiplexは、Next.jsで新しく習得したバックエンドスキルを適用するために作成しました。このプロジェクトは、ユーザーがゲームを閲覧し、詳細を確認し、ユーザー認証を通じてお気に入りを保存できるゲームライブラリです。Next.jsでバックエンドの構築から始め、ゲームデータとユーザー管理の統合に焦点を当てました。主な課題の1つは、クライアントサイドレンダリングとサーバーサイドレンダリングのどちらを使用するかを決定することでした。課題を克服しましたが、今では間違った選択をしたことに気づき、ベストプラクティスに従って再構築する計画です。",
    "iFindGalleryDescription": "iFindGalleryは、新しく学んだTypeScriptスキルを適用するために構築しました。ユーザーが画像を探索し、ダウンロードし、作者の他の作品を見ることができるギャラリーを特徴としています。UIの構築に課題があり、執拗な型エラーの解決に約8時間を費やしました。これらの苦労にもかかわらず、TypeScriptのデバッグとUI開発の改善に関する貴重な経験を得ました。",
    "viewWebsite": "ウェブサイトを見る",
    "viewSourceCode": "ソースコードを見る",
    "contactMe": "お問い合わせ",
    "contactMeDescription": "ポートフォリオをご覧いただきありがとうございます。ご質問ございましたら、お気軽にお問い合わせください。",
    "sendEmail": "メールを送る"
  }
}
